---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunNotEnoughBoundaryCurves
source: html/f0666180-5752-7199-3b50-0046be8e1c1f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunNotEnoughBoundaryCurves Property

Sketch run require boundaries (chains of one or more Boundary Lines)

## Syntax (C#)
```csharp
public static FailureDefinitionId RunNotEnoughBoundaryCurves { get; }
```